Tekla.Structures.Catalogs.MeshItem.Export(System.String@)
Exports the rebar item in the catlog to given file name.
If path is not given rebar is exported to model folder.
If filename is empty rebar name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
RebarItem item = new RebarItem();
if (item.Select("A500HW", "10", RebarItem.MAIN_USAGE))
{
string filename = System.IO.Path.GetTempPath() + "\\" + "A500HW_10_MAIN";
if (item.Export(ref filename))
{
Console.WriteLine("A500HW exported successfully");
}
}
}
}
filename: The export file name of the profile item.
Returns: True on success.